l1117/NRF51822_Datelog/main.c
#ifdef BEACON
	#define UART_POWER  				12   //5TM Power
	#define UART_RX							17
	#define UART_TX							18
	#define LED_PIN             19
	#define ADC_AIN						  1 
#else
	#define UART_POWER  				13   //5TM Power
	#define UART_RX							12
	#define UART_TX							10
	#define ADC_AIN						  4
	#define LED_PIN             20
#endif


/**@brief 128-bit UUID base List. */
//static const ble_uuid128_t m_base_uuid128 =
//{
//   {
//       0x23, 0xD1, 0xBC, 0xEA, 0x5F, 0x78, 0x23, 0x15,
//       0xDE, 0xEF, 0x12, 0x12, 0x00, 0x00, 0x00, 0x00
//   }
//};

static ble_gap_adv_params_t      m_adv_params;                                       /**< Parameters to be passed to the stack when starting advertising. */
//static uint8_t                  m_char_value[APP_CFG_CHAR_LEN];                     /**< Value of the characteristic that will be sent as a notification to the central. */
static uint8_t                   m_addl_adv_manuf_data[ADV_ADDL_MANUF_DATA_LEN];     /**< Value of the additional manufacturer specific data that will be placed in air (initialized to all zeros). */
//static ble_gatts_char_handles_t m_char_handles;                                     /**< Handles of local characteristic (as provided by the BLE stack).*/
static uint16_t                  m_conn_handle = BLE_CONN_HANDLE_INVALID;            /**< Handle of the current connection (as provided by the BLE stack, is BLE_CONN_HANDLE_INVALID if not in a connection).*/
static uint16_t                  m_service_handle;                                   /**< Handle of local service (as provided by the BLE stack).*/
static bool                      m_is_notifying_enabled = false;                     /**< Variable to indicate whether the notification is enabled by the peer.*/
static app_timer_id_t            m_conn_int_timer_id;                                /**< Connection interval timer. */
static app_timer_id_t            m_notif_timer_id;                                   /**< Notification timer. */
/////////////////////////added  by yelun
//static app_timer_id_t           m_s5tm_timer_id;  
static app_timer_id_t            m_timecounter_id;  
static uint32_t 							   flash_page_data[256+4];
static uint32_t 								 timer_counter = 0;
static uint32_t 							   timer_shifting = 0;
static pstorage_handle_t 				 flash_handle_last;

static ble_advdata_t             advdata;
static ble_advdata_manuf_data_t  manuf_data;
static uint8_t                   flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; //BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
#ifdef BEACON
	static uint8_t adv_name[22] = "BCON_Time:" ;
#else
	static uint8_t adv_name[22] = "CST@_Time:" ;
#endif

//static char 									 	 *advname = "Time";
//#define START_ADDRESS 0x1B000	  /*Data recordes start address, 12KB program flash from 0x160005*/
static uint16_t  Vtm_humi=0, Vtm_unknow=0, Vtm_temp=0;  //sensor data;
static int32_t   nrf_temp=0;

static bool                                  m_memory_access_in_progress = false;       /**< Flag to keep track of ongoing operations on persistent memory. */

#ifdef BLE_DFU_APP_SUPPORT    
static ble_dfu_t                             m_dfus;                                    /**< Structure used to identify the DFU service. */
#endif // BLE_DFU_APP_SUPPORT    

static uint8_t pstorage_wait_flag = 0;
static pstorage_block_t pstorage_wait_handle = 0;
static pstorage_handle_t       flash_base_handle;
static uint32_t 	flash_block_num;
// YOUR_JOB: Modify these according to requirements (e.g. if other event types are to pass through
//           the scheduler).
#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)                   /**< Maximum size of scheduler events. Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE                10                                          /**< Maximum number of events in the scheduler queue. */

// Persistent storage system event handler
void pstorage_sys_event_handler (uint32_t p_evt);


static void application_timers_stop(void);
static void application_timers_start(void);

#define TIME_PERIOD	 			5       /*5TM time period in seconds*/
#define PSTORAGE_PAGE_SIZE		1024

////////////////////////////////////////////////
/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);

}


uint16_t    batt_lvl_in_milli_volts;

#define ADC_REF_VOLTAGE_IN_MILLIVOLTS        1200                                      /**< Reference voltage (in milli volts) used by ADC while doing conversion. */
#define ADC_PRE_SCALING_COMPENSATION         3                                         /**< The ADC is configured to use VDD with 1/3 prescaling as input. And hence the result of conversion is to be multiplied by 3 to get the actual value of the battery voltage.*/
#define DIODE_FWD_VOLT_DROP_MILLIVOLTS       270                                       /**< Typical forward voltage drop of the diode (Part no: SD103ATW-7-F) that is connected in series with the voltage supply. This is the voltage drop when the forward current is 1mA. Source: Data sheet of 'SURFACE MOUNT SCHOTTKY BARRIER DIODE ARRAY' available at www.diodes.com. */
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE)\
        ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / 255) * ADC_PRE_SCALING_COMPENSATION)
void battery_start(uint32_t AnalogInput)
{
//    uint32_t err_code=0;
//	sd_nvic_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_LOW);  
//	sd_nvic_EnableIRQ(ADC_IRQn);
//	

		if (AnalogInput==4)  AnalogInput=ADC_CONFIG_PSEL_AnalogInput4 ;
		else if (AnalogInput==1)  AnalogInput=ADC_CONFIG_PSEL_AnalogInput1 ;
		else  AnalogInput=ADC_CONFIG_PSEL_AnalogInput6 ;
    // Configure ADC
    NRF_ADC->INTENSET   = AAR_INTENSET_END_Disabled;   				//ADC  Interrupt disabled. Must be disable.
    NRF_ADC->CONFIG     = (ADC_CONFIG_RES_8bit                        << ADC_CONFIG_RES_Pos)     |
                          (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |
                          (ADC_CONFIG_REFSEL_VBG                      << ADC_CONFIG_REFSEL_Pos)  |
                          (AnalogInput                   << ADC_CONFIG_PSEL_Pos)    |
                          (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);
    NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Enabled;

//			uint32_t p_is_running = 0;

//			sd_clock_hfclk_request();
//			while(! p_is_running) {  							//wait for the hfclk to be available
//				sd_clock_hfclk_is_running((&p_is_running));
//			}               
		NRF_ADC->TASKS_START = 1;							//Start ADC sampling
    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.
				uint8_t adc_delay=0;
        while (!NRF_ADC->EVENTS_END && adc_delay<0xff)  adc_delay++;
    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.

