l1117/NRF51822_Datelog/main.c
        NRF_ADC->TASKS_STOP     = 1;
				NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Disabled;
        batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(NRF_ADC->RESULT); // + DIODE_FWD_VOLT_DROP_MILLIVOLTS;
//		sd_clock_hfclk_release();
}

//void ADC_IRQHandler(void)
//{
//	/* Clear dataready event */
//  NRF_ADC->EVENTS_END = 0;	
//   batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(NRF_ADC->RESULT); // + DIODE_FWD_VOLT_DROP_MILLIVOLTS;
//	
//	//Use the STOP task to save current. Workaround for PAN_028 rev1.5 anomaly 1.
//  NRF_ADC->TASKS_STOP = 1;
//	NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Disabled;

//	//Release the external crystal
//	sd_clock_hfclk_release();
//}	


/**@brief Function for the Characteristic notification.
 *
 * @details Sends one characteristic value notification to peer if connected to it and the
 *          notification is enabled.
 */
static void char_notify(void)
{
    uint32_t err_code;
    uint16_t len = APP_CFG_CHAR_LEN;
		err_code = NRF_SUCCESS;

    // Send value if connected and notifying.
    if ((m_conn_handle != BLE_CONN_HANDLE_INVALID) && m_is_notifying_enabled)
    {
				ble_gatts_hvx_params_t 		hvx_params;
        memset(&hvx_params, 0, sizeof(hvx_params));
        hvx_params.handle   = m_bas.Vtm_date_time_handles.value_handle;  //   m_char_handles.value_handle;
//        hvx_params.handle   = m_bas.battery_level_handles.value_handle;  //   m_char_handles.value_handle;
        hvx_params.type     = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset   = 0;
        hvx_params.p_len    = &len;
//        hvx_params.p_data   = (uint8_t *) flash_load;  //m_char_value;
//				pstorage_handle_t flash_handle;

				while(true){
					hvx_params.p_data   = ((uint8_t *) &flash_page_data[(uint8_t)timer_shifting]);  //m_char_value;
					err_code = sd_ble_gatts_hvx(m_conn_handle, &hvx_params);
					if ((err_code == BLE_ERROR_NO_TX_BUFFERS) ||
							(err_code == NRF_ERROR_INVALID_STATE) ||
							(err_code == BLE_ERROR_GATTS_SYS_ATTR_MISSING)
					)
							{
									break;
							}
					else if ((err_code != NRF_SUCCESS))
							{
									APP_ERROR_HANDLER(err_code);
							}
					else 	if (timer_shifting > 254)
							{
								m_is_notifying_enabled =  false;
								application_timers_start();
								break;
							}
					else {
									timer_shifting += 5;
								}
					}
		}
}
 char char_hex( char bHex){
		bHex&=0x0f;
    if((bHex<10))
        bHex += '0';
    else bHex += 'A'-10;
//    else bHex = 0xff;
    return bHex;
}

/**@brief Function for the GAP initialization.
 *
 * @details This function shall be used to setup all the necessary GAP (Generic Access Profile)
 *          parameters of the device. It also sets the permissions.
 *
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
		uint8_t 								i;
//    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
		ble_gap_addr_t  	p_addr;
    sd_ble_gap_address_get	(	&p_addr	);
//		sprintf(adv_name, "CSTNET_%4s:%x%x%x%x%x%x",sadvname,p_addr.addr[5],p_addr.addr[4],p_addr.addr[3],p_addr.addr[2],p_addr.addr[1],p_addr.addr[0]);
//    for (i=7;sadvname[i-7];i++) adv_name[i]=sadvname[i-7];
		i = 10;
		adv_name[i++] = char_hex(p_addr.addr[5]>>4);		adv_name[i++] = char_hex(p_addr.addr[5]);
		adv_name[i++] = char_hex(p_addr.addr[4]>>4);		adv_name[i++] = char_hex(p_addr.addr[4]);
		adv_name[i++] = char_hex(p_addr.addr[3]>>4);		adv_name[i++] = char_hex(p_addr.addr[3]);
		adv_name[i++] = char_hex(p_addr.addr[2]>>4);		adv_name[i++] = char_hex(p_addr.addr[2]);
		adv_name[i++] = char_hex(p_addr.addr[1]>>4);		adv_name[i++] = char_hex(p_addr.addr[1]);
		adv_name[i++] = char_hex(p_addr.addr[0]>>4);		adv_name[i++] = char_hex(p_addr.addr[0]);
		err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)adv_name ,
                                          22);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the connectable advertisement parameters.
 *
 * @details This function initializes the advertisement parameters to values that will put 
 *          the application in connectable mode.
 *
 */
static void connectable_adv_init(void)
{
    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));
    
    m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND ;
    m_adv_params.p_peer_addr = NULL;                               // Undirected advertisement
    m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval    = CONNECTABLE_ADV_INTERVAL;
    m_adv_params.timeout     = CONNECTABLE_ADV_TIMEOUT;
}

/**@brief Function for initializing the Advertisement packet.
 *
 * @details This function initializes the data that is to be placed in an advertisement packet in 
 *          both connectable and non-connectable modes.
 *
 */

#ifdef BLE_DFU_APP_SUPPORT    
static void advertising_stop(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_stop();
    APP_ERROR_CHECK(err_code);

//    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//    APP_ERROR_CHECK(err_code);
}


/** @snippet [DFU BLE Reset prepare] */
static void reset_prepare(void)
{
    uint32_t err_code;
    
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Disconnect from peer.
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
//        err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // If not connected, then the device will be advertising. Hence stop the advertising.
        advertising_stop();
    }

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);
}
/** @snippet [DFU BLE Reset prepare] */
#endif // BLE_DFU_APP_SUPPORT    

static void service_add(void)
{
    uint32_t       			err_code;
//    ble_bas_init_t 			bas_init;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;
//    uint8_t             init_len;

    // Initialize Battery Service.
//    memset(&bas_init, 0, sizeof(bas_init));

