l1117/NRF51822_Datelog/main.c
        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISEMENT)
            { 
								advertising_start();
                // Go to system-off mode (this function will not return; wakeup will cause a reset).
//                err_code = sd_power_system_off(); 
            }
            break;
            
        case BLE_GATTS_EVT_WRITE:
            on_write(p_ble_evt);
            break;



        case BLE_GATTC_EVT_TIMEOUT:
        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server and Client timeout events.
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
        default:
            break;
    }
    
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
//    dm_ble_evt_handler(p_ble_evt);
//    ble_hrs_on_ble_evt(&m_hrs, p_ble_evt);
//    ble_bas_on_ble_evt(&m_bas, p_ble_evt);
//    ble_conn_params_on_ble_evt(p_ble_evt);
#ifdef BLE_DFU_APP_SUPPORT    
    /** @snippet [Propagating BLE Stack events to DFU Service] */
    ble_dfu_on_ble_evt(&m_dfus, p_ble_evt);
    /** @snippet [Propagating BLE Stack events to DFU Service] */
#endif // BLE_DFU_APP_SUPPORT    

    on_ble_evt(p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);

    switch(sys_evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
						break;
        case NRF_EVT_FLASH_OPERATION_ERROR:

            if (m_memory_access_in_progress)
            {
                m_memory_access_in_progress = false;
                advertising_start();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;
    // Initialize the SoftDevice handler module.
//#ifdef BEACON
//    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_250MS_CALIBRATION, false);
//#else
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, false);
//#endif
    // Enable BLE stack 
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
    
    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}



//static void dm_pstorage_cb_handler(pstorage_handle_t * p_handle,
//                                   uint8_t             op_code,
//                                   uint32_t            result,
//                                   uint8_t           * p_data,
//                                   uint32_t            data_len)
//{
//}

/**@brief Function for application main entry.
 */
/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

int main(void)
{
    uint32_t err_code = NRF_SUCCESS;
		NRF_GPIO->PIN_CNF[LED_PIN] = (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos)
                                            | (GPIO_PIN_CNF_DRIVE_S0S1 << GPIO_PIN_CNF_DRIVE_Pos)
                                            | (GPIO_PIN_CNF_PULL_Disabled << GPIO_PIN_CNF_PULL_Pos)
                                            | (GPIO_PIN_CNF_INPUT_Disconnect << GPIO_PIN_CNF_INPUT_Pos)
                                            | (GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos);
		nrf_gpio_pin_set (LED_PIN);												//Led on.
		pstorage_module_param_t		 param;
#ifndef BEACON
	 	nrf_delay_ms(20);  //There must be 20ms waitting for AT45DB161 ready from power on.
		uint32_t *spi_base_address = spi_master_init(SPI0, SPI_MODE0, 0);
		uint8_t tx_data[ ]={0XB9};
    spi_master_tx_rx(spi_base_address, 1, (const uint8_t *)tx_data, tx_data);
#else
		sd_power_dcdc_mode_set  ( NRF_POWER_DCDC_MODE_ON);
	
#endif
		NRF_GPIO->PIN_CNF[UART_POWER] = (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos)
                                            | (GPIO_PIN_CNF_DRIVE_H0H1 << GPIO_PIN_CNF_DRIVE_Pos)
                                            | (GPIO_PIN_CNF_PULL_Disabled << GPIO_PIN_CNF_PULL_Pos)
                                            | (GPIO_PIN_CNF_INPUT_Disconnect << GPIO_PIN_CNF_INPUT_Pos)
                                            | (GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos);

    timers_init();
    ble_stack_init();
    scheduler_init();    

		pstorage_init();
		param.block_size  = PSTORAGE_PAGE_SIZE;                   //Select block size of 16 bytes
		param.block_count = PSTORAGE_MAX_APPLICATIONS;                  	//Select 10 blocks, total of 160 bytes
		param.cb          = example_cb_handler;   	//Set the pstorage callback handler
		err_code = pstorage_register(&param, &flash_base_handle);
    gap_params_init();
//    sd_ble_gap_tx_power_set(4);
		service_add();
		connectable_adv_init();
//    advertising_data_init();
		{
			APP_ERROR_CHECK_BOOL(sizeof(flags) == ADV_FLAGS_LEN);  // Assert that these two values of the same.
			// Build and set advertising data
			memset(&advdata, 0, sizeof(advdata));
//			*( (uint32_t *) (m_addl_adv_manuf_data+16)) = *(uint32_t *) adv_name;
			m_addl_adv_manuf_data[16] = adv_name[0];
			m_addl_adv_manuf_data[17] = adv_name[1];
			m_addl_adv_manuf_data[18] = adv_name[2];
			m_addl_adv_manuf_data[19] = adv_name[3];
			manuf_data.company_identifier = COMPANY_IDENTIFIER;
			manuf_data.data.size          = ADV_ADDL_MANUF_DATA_LEN;
			manuf_data.data.p_data        = m_addl_adv_manuf_data;
//			advdata.name_type							= BLE_ADVDATA_SHORT_NAME;
//			advdata.short_name_len				= BLE_ADVDATA_SHORT_NAME_LEN;
			advdata.flags.size            = sizeof(flags);
			advdata.flags.p_data          = &flags;
			advdata.p_manuf_specific_data = &manuf_data;
			err_code = ble_advdata_set(&advdata, NULL);
			APP_ERROR_CHECK(err_code);
			}
		advertising_start();
//    err_code = app_timer_start(m_s5tm_timer_id,  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER), NULL);
    err_code = app_timer_start(m_timecounter_id,  APP_TIMER_TICKS(1000, APP_TIMER_PRESCALER), NULL);

		nrf_gpio_pin_clear (LED_PIN);												//Led off.

		for(;;)	{
      app_sched_execute();
			power_manage();
		}
}

/** 
 * @}
 */
